================================================================================
strings
================================================================================

"string"
'string'
$

--------------------------------------------------------------------------------

(source_file
  (fragment
    (string_literal))
  (fragment
    (string_literal)))

================================================================================
kleenean literals
================================================================================

_true
_false
_maybe
$

--------------------------------------------------------------------------------

(source_file
  (fragment
    (true))
  (fragment
    (false))
  (fragment
    (maybe)))

================================================================================
unset literal
================================================================================

_unset
$

--------------------------------------------------------------------------------

(source_file
  (fragment
    (unset)))

================================================================================
number literal
================================================================================

0
65535
4294967295
18446744073709551617
$

--------------------------------------------------------------------------------

(source_file
  (fragment
    (number))
  (fragment
    (number))
  (fragment
    (number))
  (fragment
    (number)))

================================================================================
symbol
================================================================================

:symbol
:|piped|
$

--------------------------------------------------------------------------------

(source_file
  (fragment
    (symbol
      (identifier)))
  (fragment
    (symbol
      (identifier))))

================================================================================
loop
================================================================================

_loop
_endloop

_loop
	_continue
_endloop

_loop
	_leave
_endloop

_loop
	_leave _with _unset
_endloop
$

--------------------------------------------------------------------------------



================================================================================
iterator
================================================================================

_over simple_vector.fast_elements()
_loop
_endloop

_for e _over simple_vector.fast_elements()
_loop
_endloop
$

--------------------------------------------------------------------------------

(source_file
  (fragment
    (iterator_expression
      (call
        (identifier)
        (identifier)
        (parameter_list))
      (loop_expression)))
  (fragment
    (iterator_expression
      (identifier)
      (call
        (identifier)
        (identifier)
        (parameter_list))
      (loop_expression))))
